app/helpers/recipes_helper.rb

SELECT "tags"."phrase" FROM "tags"
SELECT  "tags".* FROM "tags" WHERE "tags"."phrase" = ? LIMIT ?  [["phrase", "#party"], ["LIMIT", 1]]
INSERT INTO "tags" ("phrase", "created_at", "updated_at") VALUES (?, ?, ?)  [["phrase", "#party"], ["created_at", "2018-08-03 02:53:35.025441"], ["updated_at", "2018-08-03 02:53:35.025441"]]
INSERT INTO "recipe_tags" ("recipe_id", "tag_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["recipe_id", 1], ["tag_id", 1], ["created_at", "2018-08-03 02:53:35.038298"], ["updated_at", "2018-08-03 02:53:35.038298"]]
---
	def get_tagged(recipes)
		keyword_arr = @recipe.keyword.split

        keyword_arr.each do |word|
	      	if word[0] == "#"
	        	if Tag.pluck(:phrase).include?(word)
	          		tag = Tag.find_by(phrase: word)
	        	else
	          		tag = Tag.create(phrase: word)
	        	end
	        	recipe_tag = RecipeTag.create(recipe_id: @recipe.id, tag_id: tag.id)