app/controllers/categories_controller.rb

  def index
    @categories = Category.all
    @tag = Tag.all
---
SELECT "categories".* FROM "categories"
SELECT "tags".* FROM "tags"

  def recipes_by_category
    @category = Category.find(params[:cat_id])
    @recipes = Recipe.all
    @recipes_by_cat = []

    @recipes.each do |recipe|
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "recipes".* FROM "recipes"