app/controllers/recipes_controller.rb

def tag_recipes
  # @tag = Tag.find(params[:cat_id])
  # @recipes = Recipe.all
  # @recipes_by_tag = []

  # @recipes.each do |recipe|
  #   if recipe.keyword == @tag.id
  #     @recipes_by_tag.push(recipe)
  #   end
  # end
  # puts @recipes_by_tag
  @tag = Tag.all
  @tags = Tag.find(params[:tag_id])
  @recipes = Recipe.all
  @rtag = RecipeTag.all
  @recipes_by_tag = []

  @rtag.each do |rtag|
    if rtag.tag_id == @tags.id
      recipe = Recipe.find(rtag.recipe_id)
---
SELECT "tags".* FROM "tags"
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "recipe_tags".* FROM "recipe_tags"
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def index
    @recipes = Recipe.all
    @category = Category.all
---
SELECT "recipes".* FROM "recipes"
SELECT "categories".* FROM "categories"

  def new
    @recipe = Recipe.new
    @categories = Category.all
---
SELECT "categories".* FROM "categories"

  def edit
    @categories = Category.all
---
SELECT "categories".* FROM "categories"

  def create
    @recipe = Recipe.new(recipe_params)

    respond_to do |format|
      if @recipe.save
        @recipe = get_tagged(@recipe)
        @recipe.save
---
INSERT INTO "recipes" ("name", "description", "ingredients", "directions", "created_at", "updated_at", "category_id", "song", "keyword") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "tags" ("phrase", "created_at", "updated_at") VALUES (?, ?, ?)  [["phrase", "#party"], ["created_at", "2018-08-03 02:53:35.025441"], ["updated_at", "2018-08-03 02:53:35.025441"]]

  def update
    respond_to do |format|
      if @recipe.update(recipe_params)
---
UPDATE "recipes" SET "updated_at" = ? WHERE "recipes"."id" = ?  [["updated_at", "2018-08-03 02:58:38.025442"], ["id", 1]]